import yfinance as yf
import pandas as pd
import os
import os.path as osp

stock_codes = [
    "005930.KS",  # 삼성전자
    "000660.KS",  # SK하이닉스
    "005380.KS",  # 현대차
    "035420.KS",  # 네이버
    "051910.KS",  # LG화학
    "012330.KS",  # 현대모비스
    "207940.KS",  # 삼성바이오로직스
    "005490.KS",  # POSCO
    "015760.KS",  # 한국전력
    "068270.KS",  # 셀트리온
    "055550.KS",  # 신한지주
    "017670.KS",  # SK텔레콤
    "105560.KS",  # KB금융
    "051900.KS",  # LG생활건강
    "000270.KS",  # 기아
    "000810.KS",  # 삼성화재
    "003550.KS",  # LG
    "034730.KS",  # SK
    "096770.KS",  # SK이노베이션
    "036570.KS",  # 엔씨소프트
    "066570.KS",  # LG전자
    "010950.KS",  # S-Oil
    "000030.KS",  # 우리은행
    "032830.KS",  # 삼성생명
    "090430.KS",  # 아모레퍼시픽
    "030200.KS",  # KT
    "006400.KS",  # 삼성SDI
    "018260.KS",  # 삼성에스디에스
    "009150.KS",  # 삼성전기
    "035720.KS",  # 카카오
    "251270.KS",  # 넷마블
    "139480.KS",  # 이마트
    "004020.KS",  # 현대제철
    "003670.KS",  # 포스코케미칼
    "086790.KS",  # 하나금융지주
    "011200.KS",  # HMM
    "035250.KS",  # 강원랜드
    "010130.KS",  # 고려아연
    "018880.KS",  # 한온시스템
    "006800.KS",  # 미래에셋대우
    "005830.KS",  # DB손해보험
    "004990.KS",  # 롯데지주
    "019170.KS",  # 신풍제약
    "009540.KS",  # 현대중공업
    "004370.KS",  # 농심
    "009830.KS",  # 한화솔루션
    "006260.KS",  # LS
]

csv_dir = '../stock_csv'
os.makedirs(csv_dir, exist_ok=True)

for code in stock_codes:
    df = yf.download(code)
    df.to_csv(osp.join(csv_dir,code+'.csv'))